src/InformationRegisters/НастройкиПользователейТелефонии/НастройкиПользователейТелефонии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователейТелефонии</name>
  <resources>
    <name>ВнутреннийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВнутреннийИдентификаторВАТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкиПользователейТелефонии/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьДанныеПользователя(ВнутреннийИдентификаторВАТС) Экспорт

	Запрос = Новый Запрос ("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиПользователейТелефонии.Пользователь КАК Пользователь,
	|	НастройкиПользователейТелефонии.ВнутреннийНомер КАК ВнутреннийНомер,
	|	НастройкиПользователейТелефонии.ИсходящийНомер КАК ИсходящийНомер,
	|	НастройкиПользователейТелефонии.ВнутреннийИдентификаторВАТС КАК ВнутреннийИдентификаторВАТС
	|ИЗ
	|	РегистрСведений.НастройкиПользователейТелефонии КАК НастройкиПользователейТелефонии
	|ГДЕ
	|	НастройкиПользователейТелефонии.ВнутреннийИдентификаторВАТС = &ВнутреннийИдентификаторВАТС");
	
	Запрос.УстановитьПараметр("ВнутреннийИдентификаторВАТС", ВнутреннийИдентификаторВАТС);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка;

КонецФункции

#КонецОбласти

#КонецЕсли
